JMeter.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">www.agoda.com</stringProp>
          <stringProp name="HTTPSampler.path">/search?guid=aa08efb2-431d-42ac-8ec0-425eacf231f1&amp;asq=u2qcKLxwzRU5NDuxJ0kOF3T91go8JoYYMxAgy8FkBH1BN0lGAtYH25sdXoy34qb9zCF3%2FBdBcWVFh%2Bchyst0A8lQXUNGEOSt4KdltJA8F%2FBafY9ahKptOyx4nkEY6Y8hdKT8zx5W5BioMdUuG%2F%2Fqg0qNfRRrZN0g4yLfu7BxPCvVra7G0XiPHpF4VmPSCHIT&amp;city=14690&amp;tick=638176040734&amp;txtuuid=aa08efb2-431d-42ac-8ec0-425eacf231f1&amp;locale=en-us&amp;ckuid=e342d613-c7c9-4c94-b509-e9094bd71172&amp;prid=0&amp;currency=USD&amp;correlationId=0496632e-dac8-48bc-b6a6-fdf83276d08b&amp;analyticsSessionId=-4540324781120638189&amp;pageTypeId=1&amp;realLanguageId=1&amp;languageId=1&amp;origin=EG&amp;cid=-1&amp;userId=e342d613-c7c9-4c94-b509-e9094bd71172&amp;whitelabelid=1&amp;loginLvl=0&amp;storefrontId=3&amp;currencyId=7&amp;currencyCode=USD&amp;htmlLanguage=en-us&amp;cultureInfoName=en-us&amp;memberId=307841799&amp;machineName=am-pc-4g-acm-web-user-5f744bd995-kfwjq&amp;trafficGroupId=4&amp;sessionId=aaqciar3vmgfo1jhthcj35hk&amp;trafficSubGroupId=4&amp;aid=130243&amp;useFullPageLogin=true&amp;cttp=4&amp;isRealUser=true&amp;mode=production&amp;browserFamily=Chrome&amp;checkIn=2023-04-26&amp;checkOut=2023-04-27&amp;rooms=1&amp;adults=1&amp;children=0&amp;priceCur=USD&amp;los=1&amp;textToSearch=Seoul&amp;productType=-1&amp;travellerType=0&amp;familyMode=off</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>